export type TTUCMCWork = {
  id: string
  name: string
  link: string
  date: string
  description: string
  thumbnailURL: string
}

export const StickerNames: Record<string, string> = {
  "22-07-10": "Sum Crisis PNG Stickers 1/2565",
  "21-07-19": "Sum Crisis PNG Stickers 1/2564",
  "21-07-06": "Giveaway PNG Stickers",
  "21-01-30": "Triam Udom Open House 2021 PNG Stickers"
}

export const BackgroundNames: Record<string, string> = {
  "22-01-14": "Triam Udom Open House 2022 Wallpapers",
  "22-07-14": "Sum Crisis 1/2565 Wallpapers"
}

export const TUCMCWork: Record<string, Array<TTUCMCWork>> = {
  2562: [
    {
      id: "2562-1",
      thumbnailURL: "/assets/images/projects/2562/1.jpg",
      name: "Giveaway: ตารางสอบ Final Crisis 1/2562",
      link: "https://drive.google.com/drive/folders/1EPk8FG5nxkl4f9vnrNCSA7AyvDvw96xz?usp=sharing",
      date: "3/9/2019",
      description:
        "Final is calling...📚\n🗓 มาแล้วกับตารางสอบปลายภาค ภาคเรียนที่ 1/2562 สำหรับนักเรียนทุกระดับชั้น! \n.\nGood luck on your exam.I know we’ll made it through 😜✌🏻"
    },
    {
      id: "2562-2",
      thumbnailURL: "/assets/images/projects/2562/2.jpg",
      name: "ตารางสอบ Sum Crisis 2/2562",
      link: "https://drive.google.com/drive/folders/1_xv1OFzD0DZxVIQXGKt6fQHSmlcuZnRC?usp=sharing",
      date: "11/12/2019",
      description:
        "มาแล้วตารางสอบ Summative ภาคเรียนที่ 2 ❗️\n🎄 \n.\n❄️ Merry Christmas. Hope Santa gives you what you wish for."
    },
    {
      id: "2562-3",
      thumbnailURL: "/assets/images/projects/2562/3.jpg",
      name: "Triam Udom Open House 2020",
      link: "https://triamudomoph2020.netlify.app/",
      date: "11/1/2020",
      description:
        "Next station...Triam Udom 🛤\nกลับมาอีกครั้งกับงานนิทรรศการวิชาการ 82 ปี เตรียมอุดมศึกษา\n.\nพบกับกิจกรรมที่น่าสนใจมากมาย ไม่ว่าจะเป็น...\n🌟 แนะแนวการศึกษาต่อ และให้คำปรึกษาเกี่ยวกับสายการเรียน จากรุ่นพี่\n🌟 การแสดงจากชมรมต่าง ๆ อีกมากมาย\nมาขึ้นรถไฟไปพร้อม ๆ กัน ที่สถานีกลาง โรงเรียนเตรียมอุดมศึกษา ในวันที่ 9 และ 10 มกราคมนี้ ❗"
    },
    {
      id: "2562-4",
      thumbnailURL: "/assets/images/projects/2562/4.jpg",
      name: "Giveaway: ตารางสอบ Final Crisis 2/2562",
      link: "https://drive.google.com/drive/folders/1MkX1a2jZvewroYmYmo5ai9m1GmlOPG7H?usp=sharing",
      date: "27/1/2020",
      description:
        "FinalCrisis 💥\nมาแล้ว Give Away ตารางสอบปลายภาค ภาคเรียนที่ 2/2562\nอย่าลืมใส่หน้ากาก ดูแลสุขภาพกันด้วยนะคะ 😷 👭"
    },
    {
      id: "2562-5",
      thumbnailURL: "/assets/images/projects/2562/5.jpg",
      name: "83 Facts About Triam Udom",
      link: "https://tucm.cc/u/83-facts",
      date: "11/5/2020",
      description:
        "— พวกเราขอต้อนรับน้อง ๆ TU83 ทุกคน พร้อมกับ “83 FACTS ABOUT เตรียมอุดมฯ” ที่นักเรียนเตรียมฯ ต้องรู้ ❗️\n🔐 เชื่อว่าน้องหลาย ๆ คน คงมีคำถามและข้อสงสัยเกี่ยวกับโรงเรียนเรามากมาย วันนี้เลยจัดมาให้อ่านแก้เบื่ออยู่บ้านแบบจุก ๆ เตรียมพร้อมรับเปิดเทอมกันไปเลย"
    },
    {
      id: "2562-6",
      thumbnailURL: "/assets/images/projects/2562/6.jpg",
      name: "IG Filter: สุ่มชมรม",
      link: "https://www.facebook.com/triamudomclubs/videos/609382266359723/",
      date: "3/7/2020",
      description: "ฟิลเตอร์สุ่มชมรม โดยคณะกรรมการกลางงานกิจกรรมพัฒนาผู้เรียนโรงเรียนเตรียมอุดมศึกษา 💖"
    },
    {
      id: "2562-7",
      thumbnailURL: "/assets/images/projects/2562/7.jpg",
      name: "Giveaway: ตารางสอบ SUM Crisis 1/2563",
      link: "https://drive.google.com/drive/folders/1y9UKo2FxQ8bzGUNFbM6ViTOxCzzT57Y8?usp=sharing",
      date: "9/8/2020",
      description:
        "ช่วงใกล้สอบแบบนี้ แน่นอนว่าเรามีตารางสอบมาแจกทุกคน ! \n— Give Away ตารางสอบ Summative 1/2563 มาในธีม “Study from home” 💻\nเราจะผ่าน SUM นี้ไปด้วยกัน 🤝"
    }
  ],
  2563: [
    {
      id: "2563-1",
      thumbnailURL: "/assets/images/projects/2563/1.jpg",
      name: "Giveaway: Daily Planner",
      link: "https://drive.google.com/drive/folders/1-3IYXQQoRu3F2xL3y3wj7aSwsJ4JJcL_?usp=sharing",
      date: "19/8/2020",
      description:
        "ใกล้สอบแล้วอ่านหนังสือทันกันหรือป่าว 👀 ✨ วางแผนการอ่านหนังสือด้วย Daily Planner สุดน่ารัก จาก กช.  🧬🧽 มาโหลดไปใช้กันได้เลย ม้าวส์ 😻\n 📓🧪 ( 𝙶𝙸𝚅𝙴𝙰𝚆𝙰𝚈  𝙳𝙰𝙸𝙻𝚈  𝙿𝙻𝙰𝙽𝙽𝙴𝚁 𝙰𝙽𝙳 𝙼𝙴𝙼𝙾 *)✂️☁️  อ่านหนังสือช่วง Summative !!! พร้อมให้ดาวน์โหลดไปใช้กันแล้ววันนี้\nเราจะผ่านซัมนี้ไปด้วยกัน"
    },
    {
      id: "2563-2",
      thumbnailURL: "/assets/images/projects/2563/2.jpg",
      name: "Giveaway: ตารางสอบ Final Crisis 1/2563",
      link: "https://drive.google.com/drive/folders/1-PRFkyhkwjtqXMKsTAOKU8Y6dk4FVBbA?usp=sharing",
      date: "2/10/2020",
      description:
        'รอกันนานใช่มั้ย ? ? 👀 ตารางสอบมาแล้วค่ะคุณพี่ ! 🏃🏻‍♀️💨\nꔛ 𝙶𝙸𝚅𝙴 𝙰𝚆𝙰𝚈 ตารางสอบ 𝙵𝚒𝚗𝚊𝚕 1/2563 ✧.* และครั้งนี้เรามาในตีม " ขนมหวานและผลไม้ จัดมาให้ทุกคนได้ชื่นใจรับไฟนอล ทั้ง ซ่าหริ่ม ลำไย ท้อ " 🖐🏻 พร้อมใช้งานแล้ว \nเราจะผ่าน final ไปด้วยกัน 🦙'
    },
    {
      id: "2563-3",
      thumbnailURL: "/assets/images/projects/2563/3.jpg",
      name: "Giveaway: ตารางเรียน 2/2563",
      link: "http://tucm.cc/r/?l=sc63",
      date: "15/12/2020",
      description:
        "✧.* ลองมั้ย 🤶🏻 ᯓ ลองมาใช้ตารางสอนจาก กช. กัน  ꔛ 🎒\nʬʬʬ 🎄 Give Away ตารางสอนปีการศึกษา 2/2563 มาในรูปแบบสีสันสดใสทำให้หัวใจคุณซู่ซ่า 🥤พร้อมให้โหลดไปใช้กันแล้วสำหรับทุกห้องเรียน\n𓂃｡ 🦌อย่าให้ชั้นรู้วบ์ว่าเธอยังไม่ได้ใช้"
    },
    {
      id: "2563-4",
      thumbnailURL: "/assets/images/projects/2563/4.jpg",
      name: "Giveaway: ตารางสอบ Sum Crisis 2/2563",
      link: "https://tucm.cc/L8cD",
      date: "17/1/2021",
      description:
        "꒰ โรงเรียนก็อดไป หวานใจก็อดเจอ ꒱ \n⁕ 🛼 ꒰ Give Away ตารางสอบ Summative 2/2563🥛,🐄 ꒱ พร้อมใช้งานแล้ว\nꕁ เราจะผ่าน Sum นี้ไปด้วยกัน 🫐"
    },
    {
      id: "2563-5",
      thumbnailURL: "/assets/images/projects/2563/5.jpg",
      name: "Triam Udom Open House 2021 -  IG Filter : คุณจะเข้ามาเป็นใครในเตรียมฯ",
      link: "https://www.facebook.com/TriamUdomOPH/videos/1074903802988424/",
      date: "29/1/2021",
      description:
        "⌗ ֯  ꒰ เพราะการเป็นเด็กเตรียมฯ ให้อะไรมากกว่าที่ทุกคนคิด ꒱ \n🪡🎿 𖥉 IG filter #คุณจะเข้ามาเป็นใครในเตรียมฯ\nพร้อมให้ใช้งานแล้ววันนี้ !! 🧼📒҂𓈒"
    },
    {
      id: "2563-6",
      thumbnailURL: "/assets/images/projects/2563/6.jpg",
      name: "Triam Udom Open House 2021 - Giveaway: PNG",
      link: "https://drive.google.com/drive/folders/11dxhvSjqLbYu0VEgN9FCpWgROUJJG5oU",
      date: "31/1/2021",
      description:
        "‎⌗ 🐮 น้อง ๆ คนไหนกำลังอ่านหนังสืออยู่ พวกเรามีของมาฝาก ✸ 🥚\n‎⁺◟🥛 ꒰ Give Away png ꒱ 🍞⊹ สุดน่ารักเอาไปแปะเพิ่มความเท่ 10 เท่าไปเลยงับ"
    },
    {
      id: "2563-7",
      thumbnailURL: "/assets/images/projects/2563/7.jpg",
      name: "Giveaway: ตารางเรียนออนไลน์ สำหรับนักเรียนชั้น ม.6 ปีการศึกษา 2563",
      link: "https://drive.google.com/drive/folders/1kVcEuBchA3_tCDMN5zx9q4d0Y0HuE9we?usp=sharing",
      date: "1/2/2021",
      description:
        "˗ˏˋ ♡ อดเจอหวานใจเพราะต้องเรียนออนไลน์ 💅🏼ˎˊ˗\n\n( Give Away ) ตารางเรียนออนไลน์สำหรับนักเรียนชั้น ม.6 วันที่ 1 กุมภาพันธ์-16 มีนาคม 𓂃"
    },
    {
      id: "2563-8",
      thumbnailURL: "/assets/images/projects/2563/8.jpg",
      name: "Triam Udom Online Open House 2021",
      link: "https://openhouse2021.tucmc.vercel.app",
      date: "12/2/2021",
      description:
        "𓂃꙳ ⋆ 🪄 Success occurs when opportunity meets preparation 🧑🏻‍🔬 ´ˎ˗\nเตรียมความพร้อมสู่รั้วเตรียมอุดมศึกษาไปกับพวกเรา ♡´🛒*\n🏫 ◞˚ พบกับ Triam Udom Online Open House 2021 งานเปิดบ้านในรูปแบบออนไลน์ครั้งแรกของโรงเรียนเตรียมอุดมศึกษา เปิดหน้าจอแล้วมาพบกัน 12-13 กุมภาพันธ์นี้ มารู้จักกับโรงเรียนของเราให้มากขึ้น ครบ จบในช่องทางเดียวได้ที่ ·˚🔎  ༘ * website  https://openhouse.triamudom.ac.th \n* ꒰ ї ꒱ 🖍🖇 พบกับ เนื้อหาและรายการต่าง ๆ มากมาย\nꔛ  LIVE แนะนำสายการเรียน สัมภาษณ์รุ่นพี่ เผยเคล็ดลับการเตรียมตัวสอบเข้า\nꔛ คลิป, บทความที่น่าสนใจจากรุ่นพี่เตรียมอุดมฯ\n ꔛ Give Away ปฏิทินสอบเข้าและ Sticker สุดน่ารัก  \nꔛ และอื่น ๆ อีกมากมายที่รอน้อง ๆ ทุกคนอยู่\nรักน้องตั้งแต่ยังไม่เห็นหน้า แล้วเจอกัน ♡´🖐🏻*"
    },
    {
      id: "2563-9",
      thumbnailURL: "/assets/images/projects/2563/9.jpg",
      name: "Giveaway: Earth Tone Planner",
      link: "https://drive.google.com/drive/folders/10gaA2rZWksHUC7sf89C39cxeBkP2Cj8C",
      date: "11/3/2021",
      description: "◟꒰ Give Away ꒱ : earth tone planner 🥨🧀"
    },
    {
      id: "2563-10",
      thumbnailURL: "/assets/images/projects/2563/10.jpg",
      name: "Giveaway: PNG",
      link: "https://drive.google.com/drive/folders/1-8h2nhjvsXykw8-pKJOSiJPYDkbw0ltB",
      date: "8/7/2021",
      description: "🦙𓂃 Give Away : PNG 🩴⋆⸝⸝"
    }
  ],
  2564: [
    {
      id: "2564-1",
      thumbnailURL: "/assets/images/projects/2564/1.jpg",
      name: "Giveaway: Sum Crisis PNG Stickers",
      link: "https://drive.google.com/drive/folders/1-8nnuRIrHreJKqZmABB42-fQo4srnBdZ",
      date: "25/7/2021",
      description: "🦉₊✧ Giveaway: Sum Crisis PNG Stickers 🍋𓂃𓈒\n✶ Sum นี้ต้องรอด ✊🏼"
    },
    {
      id: "2564-2",
      thumbnailURL: "/assets/images/projects/2564/2.jpg",
      name: "ตารางสอบ Sum Crisis 1/2564",
      link: "https://drive.google.com/drive/folders/1FE4DzW0JIG-bF5B7wgw2eDTYm7SL0ON9",
      date: "30/7/2021",
      description: "💌 ตารางสอบพร้อมแล้ว คุณพร้อมหรือยัง 🖐🏻 ˈ❕\nSum นี้ต้องรอด ✊🏼ˎˊ˗"
    },
    {
      id: "2564-3",
      thumbnailURL: "/assets/images/projects/2564/3.jpg",
      name: "IG Filter: ความลับของดวงดาว",
      link: "https://www.facebook.com/triamudomclubs/videos/1220896388333997/",
      date: "23/8/2021",
      description:
        "˚꒰ 🔮 LET THE STARS GUIDE YOU 💫 ꒱•\n\n✳︎ 🪄IG filter #ความลับของดวงดาว is available now ‧₊˚✨\n\nˏˋ° มาเล่นกันเยอะ ๆ นะ ! ◞⁺ ｡"
    },
    {
      id: "2564-4",
      thumbnailURL: "/assets/images/projects/2564/4.jpg",
      name: "Giveaway: Mood Tracker",
      link: "https://drive.google.com/drive/folders/1-D3W2rAk7tzwIfAC9QFLf-64hfhpAi5o",
      date: "27/8/2021",
      description:
        "ヽ꒰ ✍🏻 เรียนออนไลน์คือหน้าที่เธอ ใส่ใจเสมอคือหน้าที่เรา ꒱ 🖇\n\nสถานการณ์โควิด-19 ในช่วงนี้ ทำให้ทุกคนต้องเรียนออนไลน์เจอทั้งความเครียดและความกดดันต่าง ๆ วันนี้เราจึงมาแนะนำให้ทุกคนได้รู้จักกับ Mood Tracker ตัวช่วยที่จะทำให้ทุกคนได้กลับมาทบทวนตัวเองและรู้จักกับตัวเองมากขึ้น ✨\n\n𓈈🧘🏻‍♀️ Mood tracker คืออะไรและมีประโยชน์ยังไง ❔\n\nMood Tracker คือสมุดจดบันทึกอารมณ์ความรู้สึกของเราคล้ายไดอารี โดยจะใช้สีต่าง ๆ แทนอารมณ์ความรู้สึก เป็นการบันทึกแบบวันต่อวัน เพื่อทบทวนเหตุการณ์ที่เกิดขึ้นภายในวันนั้น และสังเกตว่าเรารู้สึกอย่างไร ซึ่ง Mood Tracker จะช่วยให้เรารู้จักตัวเองมากขึ้น รู้ว่าสิ่งไหนทำให้เรามีความสุขหรือไม่มีความสุข และยังช่วยดูแลสุขภาพจิตของเราได้อีกด้วย 🪄‧₊˚"
    },
    {
      id: "2564-5",
      thumbnailURL: "/assets/images/projects/2564/5.jpg",
      name: "Giveaway: Monthly Planner",
      link: "https://drive.google.com/drive/folders/1-NdiX098KhZ6jZfpWg2_hqN9OiX9NA-v?usp=sharing",
      date: "31/8/2021",
      description: "✴︎ 🤸🏻 เริ่มต้นเดือนใหม่ ด้วยอะไรใหม่ ๆ ミ💡\n𓂋✨ New month, New me ˎˊ˗"
    },
    {
      id: "2564-6",
      thumbnailURL: "/assets/images/projects/2564/6.jpg",
      name: "Giveaway: Digital Notebook",
      link: "https://drive.google.com/drive/folders/1P-YDYfGYNxYyCcuk1_Q5P0bLyPZGP-vR",
      date: "15/9/2021",
      description: "สัปดาห์สอบใกล้มาถึงแล้ว 👀✨ มาจดสรุปด้วยสมุดโน้ตสุดน่ารัก จาก กช. กันเถอะ 🧤⊹˚"
    },
    {
      id: "2564-7",
      thumbnailURL: "/assets/images/projects/2564/7.jpg",
      name: "Giveaway: ตารางสอบ Final Crisis 1/2564",
      link: "https://drive.google.com/drive/folders/1mxRXsnmuR0q6b8hiUR1K8YzfffO_5hgG",
      date: "25/9/2021",
      description: "꒰ Giveaway ꒱ ตารางสอบ Final 1/2564 🍰\nꕊ📔 We will make it through. 🧤ˈ"
    },
    {
      id: "2564-8",
      thumbnailURL: "/assets/images/projects/2564/8.jpg",
      name: "Giveaway: ระบบสร้างตารางเรียนออนไลน์ 2/2564",
      link: "https://schedule.tucm.cc/",
      date: "31/10/2021",
      description: "✳︎ ตารางเรียนจาก กช. ปีนี้พิเศษกว่าปีไหน ๆ ถ้าอยากรู้ว่าพิเศษยังไงต้องไปดู 👀"
    },
    {
      id: "2564-9",
      thumbnailURL: "/assets/images/projects/2564/9.jpg",
      name: "ลอยกระทงออนไลน์​ 2564",
      link: "https://loy-kratong.vercel.app/",
      date: "19/11/2021",
      description:
        "﹆ 🌊 ลอยกระทงกันแล้ว ขอเชิญเด็กเตรียมฯ มาลอยกระทง •♪.\n\nเว็บไซต์ลอยกระทงออนไลน์ 2021 พร้อมให้ใช้งานแล้ว 🌙ˊ˗\n✶ สร้างกระทงตามสไตล์คุณ\n✶ ของตกแต่งมากมาย\n✶ ใส่คำอธิษฐาน\n✶ บันทึกภาพกระทง"
    },
    {
      id: "2564-10",
      thumbnailURL: "/assets/images/projects/2564/10.jpg",
      name: "Triam Udom Online Open House 2022",
      link: "https://openhouse-2022.vercel.app",
      date: "14/1/2022",
      description:
        "🚏Get ready for Triam Udom Online Open House 2022 ⟢\n— Interstellar Odyssey 🪐🪄✨\n\nꔚ จักรวาลแห่งนี้รอทุกคนอยู่ แพ็คกระเป๋าแล้วขึ้นยานอวกาศมาค้นหาดวงดาวของน้อง ๆ ไปด้วยกันในวันที่ 14-15 มกราคมนี้ 🕵🏻𓏭"
    }
  ],
  2565: [
    {
      id: "2565-1",
      thumbnailURL: "/assets/images/projects/2565/1.jpg",
      name: "Giveaway: ตารางเรียนภาคเรียนที่ 1/2565",
      link: "https://schedule.tucm.cc?type=learn",
      date: "7/7/2022",
      description:
        "🎌 ญี่ปุ่นมีเทศกาลทานาบาตะ ꔛ\nแล้วเธออะ มีตารางเรียน กช. ยัง❕\n\n‎˗ˏˋ Giveaway ´ˎ˗ ตารางเรียนภาคเรียนที่ 1/2565 สำหรับนักเรียนทุกระดับชั้น เลือกสีที่ชอบได้ด้วย~ ดาวน์โหลดได้ที่ลิงก์บน bio หรือสแกน QR code ในโพสต์ได้เลย ꕤ.\n\n🎋 พิเศษ ! ฉลองเทศกาลทานาบาตะ ทุกคนสามารถแชร์กระดาษคำอวยพรลง story และเขียนคำอวยพรให้ตัวเองหรือคนพิเศษของใจก็ได้ ʚ♡⃛ɞ\n\n🎐 ขอให้พรที่ทุกคนขอเป็นจริงนะ ! ถ้าพร้อมแล้ว…มา make a wish กันเถอะ ★ ∗˚\n\n#เลือกสีได้ด้วยนะ #ก็เปลี่ยนสีไปเลยสิคะ"
    },
    {
      id: "2565-2",
      thumbnailURL: "/assets/images/projects/2565/2.jpg",
      name: "Giveaway: ตารางสอบ Summative 1/2565",
      link: "https://drive.google.com/drive/folders/1onZOOKrDg4_6sOExNY27OvOZCNWlXa4a?usp=sharing",
      date: "12/7/2022",
      description:
        "🗯 Are you ready to receive a receipt? 🧾\n\n꒰ Giveaway ꒱ ตารางสอบ Summative 1/2565 ˚ ༘\nสามารถดาวน์โหลดได้ที่ลิงก์บน bio หรือสแกน QR code ในรูปถัดไป 🛒\n\n⌯﹡⋆ Wish you all of the best luck and get a good score. 💯"
    },
    {
      id: "2565-3",
      thumbnailURL: "/assets/images/projects/2565/3.jpg",
      name: "Giveaway: Sum Crisis PNG stickers & wallpapers",
      link: "https://drive.google.com/drive/folders/16V-_YmQM7BLWuyhOt2Vi_zVZ5cgfCaPm?usp=sharing",
      date: "14/7/2022",
      description:
        "°˖✧◝ It’s time for shopping. 🛍\n\n꒰ Giveaway ꒱ PNG stickers และ wallpapers ꒰ shopping theme ꒱ น่ารัก ๆ จากพวกเรา\nพร้อมให้ดาวน์โหลดแล้ว ~* จิ้มที่ลิงก์บน bio หรือสแกน QR code ได้ที่รูปถัดไป 🥫\n\n｡ -  อย่าลืมชวนทุกคนมาชอปปิงด้วยกันนะ  ꔛ⋆｡\n\n#หยิบของใส่ตะกร้าท้าsummative #สติกเกอร์น่ารัก"
    },
    {
      id: "2565-4",
      thumbnailURL: "/assets/images/projects/2565/4.jpg",
      name: "IG filter: ผองเพื่อนตัวน้อย",
      link: "https://www.instagram.com/reel/ChuR6LkJt1x/?utm_source=ig_web_copy_link",
      date: "26/8/2022",
      description:
        "യ Happy International Dog Day 🐶\n\n🚩 TUCMC x @animalsoftriamudom \n\n꒰ สุขสันต์วันสุนัขโลก ꒱ พวกเรามีกรอบฟิลเตอร์ cute cute มาให้ทุกคนได้ลองเล่นกัน\n\n🐾 IG filter #ผองเพื่อนตัวน้อย is available now ✧.*\n\n‧⁺◟ให้เหล่าเพื่อนตัวน้อยได้เป็นส่วนหนึ่งในภาพความทรงจำของทุกคนกัน !"
    },
    {
      id: "2565-5",
      thumbnailURL: "/assets/images/projects/2565/5.jpg",
      name: "IG filter: สัตว์ตัวไหนที่ใช่คุณ",
      link: "https://www.instagram.com/reel/Ch6-Pr7plXr/?utm_source=ig_web_copy_link",
      date: "31/8/2022",
      description:
        "🦈 ฉลามอะชอบงับคุณ ส่วนเราอะชอบ filter กช. งับ ﹆\n\nയ ⋆ พบกับฟิลเตอร์ล่าสุดจาก กช. #สัตว์ตัวไหนที่ใช่คุณ ที่จะบอกได้ว่าคุณเป็นสัตว์อะไรในเตรียมอุดมฯ มาลองเล่นกันเยอะ ๆ นะ !\n\n🐿 TUCMC x @animalsoftriamudom\n\n꒰ น่ารักขนาดนี้ ปั่นขนาดนี้ ป่วนขนาดนี้ ไม่ใช้ไม่ได้แล้วปะ ꒱"
    },
    {
      id: "2565-6",
      thumbnailURL: "/assets/images/projects/2565/6.jpg",
      name: "Giveaway: ตารางสอบ Final 1/2565",
      link: "https://drive.google.com/drive/folders/17ZnYTHvQUEfH2sh71DLfeRLGSxBOItz2?usp=sharing",
      date: "8/9/2022",
      description:
        "🎲 Final นี้มาเล่น Gacha สุ่มดวงชะตากัน !\n\nGiveaway ★ ตารางสอบ Final 1/2565 ★ พร้อมใช้งานแล้ว สามารถดาวน์โหลดได้ที่ลิงก์บน bio หรือสแกน QR code ในรูปถัดไปได้เลย *. ⋆\n\nGacha ของ กช. รอให้ทุกคนมากดใช้อยู่นะ >.<"
    }
  ]
}
