export const TUCMCWork: Record<
  string,
  Array<{ name: string; link: string; date: string; description: string; thumbnailURL: string }>
> = {
  2562: [],
  2563: [],
  2564: [
    {
      name: "ลอยกระทงออนไลน์​ 2564",
      link: "https://loy-kratong.vercel.app/",
      date: "19/11/2021",
      description:
        "﹆ 🌊 ลอยกระทงกันแล้ว ขอเชิญเด็กเตรียมฯ มาลอยกระทง •♪.\n\nเว็บไซต์ลอยกระทงออนไลน์ 2021 พร้อมให้ใช้งานแล้ว 🌙ˊ˗\n✶ สร้างกระทงตามสไตล์คุณ\n✶ ของตกแต่งมากมาย\n✶ ใส่คำอธิษฐาน\n✶ บันทึกภาพกระทง",
      thumbnailURL: "/assets/images/placeholder/thumb1.png"
    },
    {
      name: "ลอยกระทงออนไลน์​ 2564",
      link: "https://loy-kratong.vercel.app/",
      date: "19/11/2021",
      description:
        "﹆ 🌊 ลอยกระทงกันแล้ว ขอเชิญเด็กเตรียมฯ มาลอยกระทง •♪.\n\nเว็บไซต์ลอยกระทงออนไลน์ 2021 พร้อมให้ใช้งานแล้ว 🌙ˊ˗\n✶ สร้างกระทงตามสไตล์คุณ\n✶ ของตกแต่งมากมาย\n✶ ใส่คำอธิษฐาน\n✶ บันทึกภาพกระทง",
      thumbnailURL: "/assets/images/placeholder/position.jpg"
    },
    {
      name: "ลอยกระทงออนไลน์​ 2564",
      link: "https://loy-kratong.vercel.app/",
      date: "19/11/2021",
      description:
        "﹆ 🌊 ลอยกระทงกันแล้ว ขอเชิญเด็กเตรียมฯ มาลอยกระทง •♪.\n\nเว็บไซต์ลอยกระทงออนไลน์ 2021 พร้อมให้ใช้งานแล้ว 🌙ˊ˗\n✶ สร้างกระทงตามสไตล์คุณ\n✶ ของตกแต่งมากมาย\n✶ ใส่คำอธิษฐาน\n✶ บันทึกภาพกระทง",
      thumbnailURL: "/assets/images/placeholder/thumb1.png"
    },
    {
      name: "ลอยกระทงออนไลน์​ 2564",
      link: "https://loy-kratong.vercel.app/",
      date: "19/11/2021",
      description:
        "﹆ 🌊 ลอยกระทงกันแล้ว ขอเชิญเด็กเตรียมฯ มาลอยกระทง •♪.\n\nเว็บไซต์ลอยกระทงออนไลน์ 2021 พร้อมให้ใช้งานแล้ว 🌙ˊ˗\n✶ สร้างกระทงตามสไตล์คุณ\n✶ ของตกแต่งมากมาย\n✶ ใส่คำอธิษฐาน\n✶ บันทึกภาพกระทง",
      thumbnailURL: "/assets/images/placeholder/position.jpg"
    }
  ]
}
